Revit 2024 API
StructuralSectionIWideFlange Class
 Defines parameters for I-shape Wide Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionIWideFlange : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionIWideFlange _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionIWideFlange : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange
See Also
StructuralSectionIWideFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace